In [12]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (0.5.0)
Requirement already satisfied: prettytable in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from ipython-sql) (3.12.0)
Requirement already satisfied: ipython in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython-sql) (8.22.2)
Requirement already satisfied: sqlalchemy>=2.0 in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from ipython-sql) (2.0.36)
Requirement already satisfied: sqlparse in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: six in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.6.0 in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from sqlalchemy>=2.0->ipython-sql) (4.12.2)
Requirement already satisfied: decorator in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython->ipython-sql) (0.19.1)
Requirement already satisfied: matplotlib-inline in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython->ipython-sql) (3.0.43)
Requirement already satisfied: pygments>=2.4.0 in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython->ipython-sql) (2.17.2)
Requirement already satisfied: stack-data in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython->ipython-sql) (0.6.3)
Requirement already satisfied: traitlets>=5.13.0 in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython->ipython-sql) (5.14.2)
Requirement already satisfied: pexpect>4.3 in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython->ipython-sql) (4.9.0)
Requirement already satisfied: wcwidth in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: executing>=1.2.0 in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from stack-data->ipython->ipython-sql) (2.0.1)
Requirement already satisfied: asttokens>=2.1.0 in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from stack-data->ipython->ipython-sql) (2.4.1)
Requirement already satisfied: pure-eval in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from stack-data->ipython->ipython-sql) (0.2.2)

In [25]:
import prettytable

# PrettyTable için varsayılan stil tanımlaması
prettytable.DEFAULT = prettytable.__dict__.get("MSWORD_FRIENDLY", prettytable.DEFAULT)

/var/folders/5f/h_sq9qfs1593m5tqmzlkhynm0000gn/T/ipykernel_17367/1198897394.py:4: DeprecationWarning: the 'DEFAULT' constant is deprecated, use the 'TableStyle' enum instead
  prettytable.DEFAULT = prettytable.__dict__.get("MSWORD_FRIENDLY", prettytable.DEFAULT)

In [13]:
%%!
pip install --trusted-host pypi.org ipython-sql

['Requirement already satisfied: ipython-sql in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (0.5.0)',
 'Requirement already satisfied: prettytable in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from ipython-sql) (3.12.0)',
 'Requirement already satisfied: ipython in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython-sql) (8.22.2)',
 'Requirement already satisfied: sqlalchemy>=2.0 in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from ipython-sql) (2.0.36)',
 'Requirement already satisfied: sqlparse in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from ipython-sql) (0.4.4)',
 'Requirement already satisfied: six in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython-sql) (1.16.0)',
 'Requirement already satisfied: ipython-genutils in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from ipython-sql) (0.2.0)',
 'Requirement already satisfied: typing-extensions>=4.6.0 in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from sqlalchemy>=2.0->ipython-sql) (4.12.2)',
 'Requirement already satisfied: decorator in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython->ipython-sql) (5.1.1)',
 'Requirement already satisfied: jedi>=0.16 in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython->ipython-sql) (0.19.1)',
 'Requirement already satisfied: matplotlib-inline in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython->ipython-sql) (0.1.6)',
 'Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython->ipython-sql) (3.0.43)',
 'Requirement already satisfied: pygments>=2.4.0 in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython->ipython-sql) (2.17.2)',
 'Requirement already satisfied: stack-data in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython->ipython-sql) (0.6.3)',
 'Requirement already satisfied: traitlets>=5.13.0 in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython->ipython-sql) (5.14.2)',
 'Requirement already satisfied: pexpect>4.3 in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython->ipython-sql) (4.9.0)',
 'Requirement already satisfied: wcwidth in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from prettytable->ipython-sql) (0.2.13)',
 'Requirement already satisfied: parso<0.9.0,>=0.8.3 in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)',
 'Requirement already satisfied: ptyprocess>=0.5 in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)',
 'Requirement already satisfied: executing>=1.2.0 in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from stack-data->ipython->ipython-sql) (2.0.1)',
 'Requirement already satisfied: asttokens>=2.1.0 in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from stack-data->ipython->ipython-sql) (2.4.1)',
 'Requirement already satisfied: pure-eval in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from stack-data->ipython->ipython-sql) (0.2.2)']

In [14]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [15]:
%reload_ext sql

In [16]:
%sql sqlite:////Users/mehmetsenel/Desktop/SQL-JUPİTER/vbo.db

In [26]:
%%sql
SELECT * FROM Customers LIMIT 3 ;

 * sqlite:////Users/mehmetsenel/Desktop/SQL-JUPİTER/vbo.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
 (2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')]

In [18]:
%%sql
CREATE TABLE yeni_tablo(firstname varchar(20),
                        lastname varchar(20));

 * sqlite:////Users/mehmetsenel/Desktop/SQL-JUPİTER/vbo.db
Done.

[]

In [22]:
%%sql
INSERT INTO yeni_tablo VALUES ('Ali','Uzak');

 * sqlite:////Users/mehmetsenel/Desktop/SQL-JUPİTER/vbo.db
1 rows affected.

[]

In [27]:
%%sql 
SELECT * FROM yeni_tablo;

 * sqlite:////Users/mehmetsenel/Desktop/SQL-JUPİTER/vbo.db
Done.

[('Mehmet', 'Şenel'), ('Berke', 'Özer'), ('Ali', 'Uzak')]

In [28]:
%%sql
INSERT INTO yeni_tablo VALUES ('Ahmet','Canlı');

 * sqlite:////Users/mehmetsenel/Desktop/SQL-JUPİTER/vbo.db
1 rows affected.

[]

SELECT İşlemleri 

- select: seçim anlamı taşır ve veri tabanından çağırma işlemleri için sıkça kullanırız

In [38]:
%%sql
SELECT * FROM  Products LIMIT 10 ;

 * sqlite:////Users/mehmetsenel/Desktop/SQL-JUPİTER/vbo.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10),
 (4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22),
 (5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21),
 (6, "Grandma's Boysenberry Spread", 3, 2, '12 - 8 oz jars', 25),
 (7, "Uncle Bob's Organic Dried Pears", 3, 7, '12 - 1 lb pkgs.', 30),
 (8, 'Northwoods Cranberry Sauce', 3, 2, '12 - 12 oz jars', 40),
 (9, 'Mishi Kobe Niku', 4, 6, '18 - 500 g pkgs.', 97),
 (10, 'Ikura', 4, 8, '12 - 200 ml jars', 31)]

In [39]:
""" 
from = dan anlamı taşır ve veritabanı da yer alan hangi veriyi ya da satır,sutünü 
çekeceğimizi seçmemize yarar
limit : sınırlama ksııtlma seçme özelliği taşır
"""

' \nfrom = dan anlamı taşır ve veritabanı da yer alan hangi veriyi ya da satır,sutünü \nçekeceğimizi seçmemize yarar\nlimit : sınırlama ksııtlma seçme özelliği taşır\n'

In [46]:

%%sql
SELECT name FROM sqlite_master WHERE type = 'table' ;

 * sqlite:////Users/mehmetsenel/Desktop/SQL-JUPİTER/vbo.db
Done.

[('Products',),
 ('Customers',),
 ('Employees',),
 ('OrderDetails',),
 ('Orders',),
 ('Shippers',),
 ('Suppliers',),
 ('Categories',),
 ('yeni_tablo',)]

In [47]:
%%sql
SELECT * FROM  Customers where 1=0;

 * sqlite:////Users/mehmetsenel/Desktop/SQL-JUPİTER/vbo.db
Done.

[]

In [50]:
%%sql
SELECT  CustomerName ,City , Country FROM Customers LIMIT 10;

 * sqlite:////Users/mehmetsenel/Desktop/SQL-JUPİTER/vbo.db
Done.

[('Alfreds Futterkiste', 'Berlin', 'Germany'),
 ('Ana Trujillo Emparedados y helados', 'México D.F.', 'Mexico'),
 ('Antonio Moreno Taquería', 'México D.F.', 'Mexico'),
 ('Around the Horn', 'London', 'UK'),
 ('Berglunds snabbköp', 'Luleå', 'Sweden'),
 ('Blauer See Delikatessen', 'Mannheim', 'Germany'),
 ('Blondel père et fils', 'Strasbourg', 'France'),
 ('Bólido Comidas preparadas', 'Madrid', 'Spain'),
 ("Bon app'", 'Marseille', 'France'),
 ('Bottom-Dollar Marketse', 'Tsawassen', 'Canada')]

In [53]:
%%sql
SELECT Price , Price*3, Price*3-100 FROM Products LIMIT 8;

 * sqlite:////Users/mehmetsenel/Desktop/SQL-JUPİTER/vbo.db
Done.

[(18, 54, -46),
 (19, 57, -43),
 (10, 30, -70),
 (22, 66, -34),
 (21, 63, -37),
 (25, 75, -25),
 (30, 90, -10),
 (40, 120, 20)]

- * -> all anlamı taşır ve yıldız yerine özellikle çağrımak istediğimiz başlıkalr içerikler yazılabilir
- matematiksel işlemler olduğu gibi yazılarak kullanılabilir.
- AS fonksiyonu ile oluşturulan yeni sütunlar isimlendirilir ve kaydedilebilir.

In [55]:
%%sql
SELECT Price AS ilk_price , Price*3 AS yeni_price, Price*3-100 AS işlemli_price FROM Products LIMIT 10 ;

 * sqlite:////Users/mehmetsenel/Desktop/SQL-JUPİTER/vbo.db
Done.

[(18, 54, -46),
 (19, 57, -43),
 (10, 30, -70),
 (22, 66, -34),
 (21, 63, -37),
 (25, 75, -25),
 (30, 90, -10),
 (40, 120, 20),
 (97, 291, 191),
 (31, 93, -7)]

In [62]:
%%sql 
SELECT COUNT (*) AS satir_sayisi FROM Products;

 * sqlite:////Users/mehmetsenel/Desktop/SQL-JUPİTER/vbo.db
Done.

[(77,)]

In [63]:
%%sql 
SELECT * FROM Products ORDER BY Price LIMIT 10;

 * sqlite:////Users/mehmetsenel/Desktop/SQL-JUPİTER/vbo.db
Done.

[(13, 'Konbu', 6, 8, '2 kg box', 6),
 (52, 'Filo Mix', 24, 5, '16 - 2 kg boxes', 7),
 (23, 'Tunnbröd', 9, 5, '12 - 250 g pkgs.', 9),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10),
 (21, "Sir Rodney's Scones", 8, 3, '24 pkgs. x 4 pieces', 10),
 (74, 'Longlife Tofu', 4, 7, '5 kg pkg.', 10),
 (46, 'Spegesild', 21, 8, '4 - 450 g glasses', 12),
 (58, 'Escargots de Bourgogne', 27, 8, '24 pieces', 13),
 (77, 'Original Frankfurter grüne Soße', 12, 2, '12 boxes', 13),
 (25, 'NuNuCa Nuß-Nougat-Creme', 11, 3, '20 - 450 g glasses', 14)]

- sayma işlemleri için "count" ifadesi kullanılır.
- sıralama işlemleri için "order by " ifadesi yer alır bu ifade küçükten büyüğe sıralar,
tam tersi için "order by desc" ifadesi kullanılır.